//******************************************************************************
//
//
//      scene_game
//
//
//******************************************************************************

//----< インクルード >-----------------------------------------------------------
#include "all.h"

//------< 定数 >----------------------------------------------------------------


//------< 構造体 >---------------------------------------------------------------


//------< 変数 >----------------------------------------------------------------
int game_state;
int game_timer;

Sprite* sprBack;

extern int player_state;
extern int enemy_state;

//--------------------------------------
//  ゲームの初期設定
//--------------------------------------
void game_init()
{
    game_state      = 0;
    game_timer      = 0;
}

//--------------------------------------
//  ゲームの終了処理
//--------------------------------------
void game_deinit()
{
#if 2
//******************************************************************************
// TODO:02 弾の終了処理の関数を呼ぶ
//------------------------------------------------------------------------------
/*
課題）
    ここで弾の終了処理の関数を呼びましょう。
*/
//******************************************************************************
#endif
    //TODO_02
    

    // 敵の終了処理
    enemy_deinit();

    // プレイヤーの終了処理
    player_deinit();

    safe_delete(sprBack);
}

//--------------------------------------
//  ゲームの更新処理
//--------------------------------------
void game_update()
{
    switch (game_state)
    {
    case 0:
        //////// 初期設定 ////////

        sprBack = sprite_load(L"./Data/Images/ruins.jpg");

        // プレイヤーの初期設定
        player_init();

        // 敵の初期設定
        enemy_init();

#if 1
//******************************************************************************
// TODO:01 弾の初期設定関数を呼ぶ
//------------------------------------------------------------------------------
/*
課題）
    ここで弾の初期設定関数を呼びましょう。
*/
//******************************************************************************
#endif
        //TODO_01
        

        game_state++;
        /*fallthrough*/

    case 1:
        //////// パラメータの設定 ////////

        GameLib::setBlendMode(Blender::BS_ALPHA);

        game_state++;
        /*fallthrough*/

    case 2:
        //////// 通常時 ////////

        debug::setString("");
        debug::setString("A D   : LEFT, RIGHT");
        debug::setString("SPACE : JUMP");
        debug::setString("");

        // タイトルに戻る
        if (TRG(0) & PAD_SELECT)
        {
            nextScene = SCENE_TITLE;
            break;
        }

#if 3
//******************************************************************************
// TODO:03 弾の更新関数を呼ぶ
//------------------------------------------------------------------------------
/*
課題）
    ここで弾の更新関数を呼びましょう。

解説）
    関数を呼ぶ順番に注意しましょう。この教材では各updateの初回に初期設定が行われ
    る仕組みになっています。例えば敵が最初のフレームで弾を発射する可能性があるの
    で、敵より弾の更新を上に記述しておきましょう。（プレイヤーも弾を発射するよう
    になるかもしれないので、プレイヤーよりも上にしておきます。）
*/
//******************************************************************************
#endif
        //TODO_03
        

        // プレイヤーの更新
        player_update();

        // 敵の更新
        enemy_update();

        // あたり判定を行う
        judge();

        break;
    }

    game_timer++;
}

//--------------------------------------
//  ゲームの描画処理
//--------------------------------------
void game_render()
{
    // 画面をクリア
    GameLib::clear(0.2f, 0.2f, 0.4f);

    // 背景を描画
    area_render();

    // 敵を描画
    enemy_render();

#if 4
//******************************************************************************
// TODO:04 弾の描画関数を呼ぶ
//------------------------------------------------------------------------------
/*
課題）
    ここで弾の描画関数を呼びましょう。

解説）
    後から描画されるほど手前に来ます。弾は優先順位が高めなのでこの位置にしておき
    ます。
*/
//******************************************************************************
#endif
    //TODO_04
    

    // プレイヤーを描画
    player_render();
}

//--------------------------------------
//  ゲームのリスタート
//--------------------------------------
void game_reset()
{
    // ゲームをリセットする
    game_state      = 1;
    player_state    = 1;
    enemy_state     = 1;

#if 24
//******************************************************************************
// TODO:24 リスタート時にショットもリセットする
//------------------------------------------------------------------------------
/*
課題）
    ゲームをリセットする際に、ショットもリセットしておきましょう。
*/
//******************************************************************************
#endif
    //TODO_24

}
